test/request-response-samples/Message__Messages_suffixed_with_Request_Response/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:s0="urn:MessageService" xmlns:atls="http://tempuri.org/vc/atl/server/"><soap:Header></soap:Header><soap:Body><s0:Message><bstrResourceId>034b7ea5-8a04-11e3-9710-0050569575d8</bstrResourceId></s0:Message></soap:Body></soap:Envelope>